schedule["英語第五第六"] =
  key : "英語第五第六"
  color : "#ff69b4"
  data : [
    [
      "Mon,34,英語第五1-15"
      "Mon,56,英語第五16-25"
      "Thu,34,英語第五26-44"
      "Thu,56,英語第五45-48"
    ]
    [
      "Mon,34,英語第六1-15"
      "Mon,56,英語第六16-25"
      "Thu,34,英語第六26-44"
      "Thu,56,英語第六45-48"
    ]
  ]

schedule["英語第一第二"] =
  key : "英語第一第二"
  color : "#ff69b4"
  data : [
    [
      "Mon,12,英語第一1-20"
      "Thu,12,英語第一21-40"
    ]
    [
      "Mon,12,英語第二1-20"
      "Thu,12,英語第二21-40"
    ]
  ]
