# 0327 提案方式

subjects["文系2年(1)"] = ["1Q,Tue,56"]
subjects["文系2年(2)"] = ["1Q,Fri,56"]

subjects["文系2年(3)"] = ["2Q,Mon,12"]
subjects["文系2年(4)"] = ["2Q,Thu,12"]

subjects["文系3年(1)"] = ["1Q,Tue,78"]
subjects["文系3年(2)"] = ["1Q,Fri,78"]

subjects["文系3年(3)"] = ["2Q,Mon,34"]
subjects["文系3年(4)"] = ["2Q,Wed,34"]

# ===== =====

schedule["文系2年"] =
  color : "#f99"
  data : ["文系2年(1)","文系2年(2)","文系2年(3)","文系2年(4)"]

schedule["文系3年"] =
  color : "#f99"
  data : ["文系3年(1)","文系3年(2)","文系3年(3)","文系3年(4)"]

# 旧方式

schedule["文系"] =
  key : "文系"
  color : "#f99"
  data : [
    [
      "Tue,56,文系200"
      "Tue,78,文系300"
      "Fri,56,文系200"
      "Fri,78,文系300"
    ]
    [
      "Mon,12,文系200"
      "Mon,34,文系300"
      "Wed,34,文系300"
      "Thu,12,文系200"
    ]
  ]