subjects["label:英語"] = []

subjects["英語第五第六1-15"] = ["#ff69b4", ["-", "1Q,Mon,34"], ["-", "2Q,Mon,34"]]
subjects["英語第五第六16-25"] = ["#ff69b4", ["-", "1Q,Mon,56"], ["-", "2Q,Mon,56"]]
subjects["英語第五第六26-44"] = ["#ff69b4", ["-", "1Q,Thu,34"], ["-", "2Q,Thu,34"]]
subjects["英語第五第六45-48"] = ["#ff69b4", ["-", "1Q,Thu,56"], ["-", "2Q,Thu,56"]]

subjects["英語第一第二1-20"] = ["#ff69b4", ["-", "1Q,Mon,12"], ["-", "2Q,Mon,12"]]
subjects["英語第一第二21-40"] = ["#ff69b4", ["-", "1Q,Thu,12"], ["-", "2Q,Thu,12"]]
